# Lesson 4 Practice: Pandas Part 2

Use this notebook to follow along with the lesson in the corresponding lesson notebook: [L04-Pandas_Part2-Lesson.ipynb](./L04-Pandas_Part2-Lesson.ipynb).

## Instructions
Follow along with the teaching material in the lesson. Throughout the tutorial sections labeled as "Tasks" are interspersed and indicated with the icon: ![Task](http://icons.iconarchive.com/icons/sbstnblnd/plateau/16/Apps-gnome-info-icon.png). You should follow the instructions provided in these sections by performing them in the practice notebook.  When the tutorial is completed you can turn in the final practice notebook. For each task, use the cell below it to write and test your code.  You may add additional cells for any task as needed or desired.

## Task 1a: Setup

- import pandas
- re-create the `df` data frame
- re-create the `iris_df` data frame

In [7]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']})

In [3]:
iris_df = pd.read_csv('iris.csv')

## Task 2a: Inserting Columns

+ Create a copy of the `df` dataframe.
+ Add a new column named "delta" to the copy that consists of random numbers.

In [9]:
df_delta = df.copy()
new_s = pd.Series([12, 4, 3, 15, 5])
df_delta['delta'] = new_s
df_delta

   alpha beta  delta
0      0    a     12
1      1    b      4
2      2    c      3
3      3    d     15
4      4    e      5

## Task 3a: Missing Data

+ Create two new copies of the `df` dataframe:
+ Add a new column to both that has missing values.
+ In one copy, replace missing values with a value of your choice.
+ In the other copy, drop rows with `NaN` values.
+ Print both arrays to confirm.

In [11]:
df_gamma = df_delta.copy()

In [13]:
df_gamma['gamma'] = pd.Series([6, 7, 8])
df_gamma

   alpha beta  delta  gamma
0      0    a     12    6.0
1      1    b      4    7.0
2      2    c      3    8.0
3      3    d     15    NaN
4      4    e      5    NaN

In [20]:
df_gamma.fillna(0, inplace=True)
df_gamma

   alpha beta  delta  gamma
0      0    a     12    6.0
1      1    b      4    7.0
2      2    c      3    8.0
3      3    d     15    0.0
4      4    e      5    0.0

In [15]:
df_theta = df_gamma.copy()
df_theta

   alpha beta  delta  gamma
0      0    a     12    6.0
1      1    b      4    7.0
2      2    c      3    8.0
3      3    d     15    NaN
4      4    e      5    NaN

In [18]:
df_theta.dropna(inplace=True)
df_theta

   alpha beta  delta  gamma
0      0    a     12    6.0
1      1    b      4    7.0
2      2    c      3    8.0

## Task 4a: Operations
<span style="float:right; margin-left:10px; clear:both;">![Task](./media/task-icon.png)</span>

View the [Computational tools](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html) and [statistical methods](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html#method-summary) documentation.
Using the list of operational functions choose five functions to use with the iris data frame.

In [21]:
iris_df.count()

sepal_length    150
sepal_width     150
petal_length    150
petal_width     150
species         150
dtype: int64

In [22]:
iris_df.mean()

sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
dtype: float64

In [23]:
iris_df.min()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [24]:
iris_df.std()

sepal_length    0.828066
sepal_width     0.433594
petal_length    1.764420
petal_width     0.763161
dtype: float64

In [25]:
iris_df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.109369      0.871754     0.817954
sepal_width      -0.109369     1.000000     -0.420516    -0.356544
petal_length      0.871754    -0.420516      1.000000     0.962757
petal_width       0.817954    -0.356544      0.962757     1.000000

## Task 4b:  Apply

Practice using `apply` on either the `df` or `iris_df` data frames using any two functions of your choice other than `print`, `type`, and `np.sum`.

In [33]:
df_2 = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': [6, 8, 19, 3, 7]})
df_2

   alpha  beta
0      0     6
1      1     8
2      2    19
3      3     3
4      4     7

In [45]:
df_2.apply(np.mean)

alpha    2.0
beta     8.6
dtype: float64

In [46]:
df_2.apply(np.min)

alpha    0
beta     3
dtype: int64

## Task 4c.  Occurances
Identify the number of occurances for each species (virginica, versicolor, setosa) in the `iris_df` object.  *Hint*: the `value_counts` function only works on a `pd.Series` object, not on the full data frame..

In [111]:
# I want to select the species column and make it into a pd.Series
spp = pd.Series(iris_df['species'] = 'species')
spp

SyntaxError: keyword can't be an expression (<ipython-input-111-6f64a6013e7b>, line 2)

## Task 5a: String Methods

+ Create a list of five strings that represent dates in the form YYYY-MM-DD (e.g. 2020-02-20 for Feb 20th, 2020).
+ Add this list of dates as a new column in the `df` dataframe.
+ Now split the date into 3 new columns with one column representing the year, another the month and another they day.
+ Combine the values from columns `alpha` and `beta` into a new column where the values are spearated with a colon.

In [56]:
dates = pd.date_range(start='1/1/2019', periods=5)
dates = dates.strftime('%Y-%m-%d')
dates

Index(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04', '2019-01-05'], dtype='object')

In [57]:
df_delta['dates'] = dates
df_delta

   alpha beta  delta       dates
0      0    a     12  2019-01-01
1      1    b      4  2019-01-02
2      2    c      3  2019-01-03
3      3    d     15  2019-01-04
4      4    e      5  2019-01-05

In [65]:
df_delta['year'], df_delta['month'], df_delta['day'] = df_delta['dates'].str.split('-',2).str

In [66]:
df_delta

   alpha beta  delta       dates  year month day
0      0    a     12  2019-01-01  2019    01  01
1      1    b      4  2019-01-02  2019    01  02
2      2    c      3  2019-01-03  2019    01  03
3      3    d     15  2019-01-04  2019    01  04
4      4    e      5  2019-01-05  2019    01  05

In [70]:
df_delta['lambda'] = df_delta['alpha'].astype(dtype='str') + ':' + df_delta['beta']
df_delta

   alpha beta  delta       dates  year month day lambda
0      0    a     12  2019-01-01  2019    01  01    0:a
1      1    b      4  2019-01-02  2019    01  02    1:b
2      2    c      3  2019-01-03  2019    01  03    2:c
3      3    d     15  2019-01-04  2019    01  04    3:d
4      4    e      5  2019-01-05  2019    01  05    4:e

## Task 6a: Concatenation by Rows
+ Create the following dataframe
```Python
df1 = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']}, index = ['I1', 'I2' ,'I3', 'I4', 'I5'])
```
+ Create a new dataframe named `df2` with column names "delta" and "gamma" that contins 5 rows with some index names that overlap with the `df1` dataframe and some that do not.
+ Concatenate the two dataframes by rows and print the result.
+ You should see the two have combined one after the other, but there should also be missing values added. 
+ Explain why there are missing values.

In [73]:
df1 = pd.DataFrame(
  {'alpha': [0, 1, 2, 3, 4],
   'beta': ['a', 'b', 'c', 'd', 'e']}, index = ['I1', 'I2' ,'I3', 'I4', 'I5'])
df1

    alpha beta
I1      0    a
I2      1    b
I3      2    c
I4      3    d
I5      4    e

In [78]:
df2 = pd.DataFrame(
    {'delta': [6, 7, 8, 9, 10],
     'gamma': [12, 11, 13, 14, 15]}, index = 
    ['I1', 'I2', 'I3','I4','G1'])
df2

    delta  gamma
I1      6     12
I2      7     11
I3      8     13
I4      9     14
G1     10     15

In [79]:
merge = [df1, df2]

In [108]:
merge_df = pd.concat(merge)
merge_df

C:\Users\Abby\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    alpha beta  delta  gamma
I1    0.0    a     20    NaN
I2    1.0    b     21    NaN
I3    2.0    c     22    NaN
I4    3.0    d     23    NaN
I5    4.0    e     24    NaN
I1    NaN  NaN      6   12.0
I2    NaN  NaN      7   11.0
I3    NaN  NaN      8   13.0
I4    NaN  NaN      9   14.0
G1    NaN  NaN     10   15.0

Explain missing values:

## Task 6b: Concatenation by Columns

Using the same dataframes, df1 and df2, from Task 6a practice:
+ Concatenate the two by columns
+ Add a "delta" column to `df1` and concatenate by columns such that there are 5 columns in the merged dataframe.
+ Respond in writing to this question (add a new 'raw' cell to contain your answer). What will happen if using you had performed an inner join while concatenating?  
+ Try the concatenation with the inner join to see if you are correct.

In [91]:
df1['delta'] = [20, 21, 22, 23, 24]
df1

    alpha beta  delta
I1      0    a     20
I2      1    b     21
I3      2    c     22
I4      3    d     23
I5      4    e     24

In [92]:
pd.concat(merge, axis=1)

C:\Users\Abby\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    alpha beta  delta  delta  gamma
G1    NaN  NaN    NaN   10.0   15.0
I1    0.0    a   20.0    6.0   12.0
I2    1.0    b   21.0    7.0   11.0
I3    2.0    c   22.0    8.0   13.0
I4    3.0    d   23.0    9.0   14.0
I5    4.0    e   24.0    NaN    NaN

Using inner join would only combine the rows with the same index

In [93]:
pd.concat(merge, axis=1, join='inner')

    alpha beta  delta  delta  gamma
I1      0    a     20      6     12
I2      1    b     21      7     11
I3      2    c     22      8     13
I4      3    d     23      9     14

#### Task 6c: Concat and append data frames
<span style="float:right; margin-left:10px; clear:both;">![Task](./media/task-icon.png)</span>

+ Create a new 5x5 dataframe full of random numbers.
+ Create a new 5x10 dataframe full of 1's.
+ Append one to the other and print it.
+ Append a single Series of zeros to the end of the appended dataframe.

In [98]:
df3 = pd.DataFrame(np.random.randint(5, high=20,size=(5,5)))
df3

    0   1   2   3   4
0   5  12  10  15  11
1   6  10   7  19  10
2  17  17  14  13  12
3   8   6  14  18  15
4   5  17  17   5  14

In [104]:
df4 = pd.DataFrame(np.ones(5,10, ))
df4

TypeError: ones() got multiple values for argument 'dtype'

## Task 6d: Grouping

Demonstrate a `groupby`.

+ Create a new column with the label "region" in the iris data frame. This column will indicates geographic regions of the US where measurments were taken. Values should include:  'Southeast', 'Northeast', 'Midwest', 'Southwest', 'Northwest'. Use these randomly.
+ Use `groupby` to get a new data frame of means for each species in each region.
+ Add a `dev_stage` column by randomly selecting from the values "early" and "late".
+ Use `groupby` to get a new data frame of means for each species,in each region and each development stage.
+ Use the `count` function (just like you used the `mean` function) to identify how many rows in the table belong to each combination of species + region + developmental stage.